# BuiltInFailures.DividedSurfaceFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures Class
BuiltInFailures Class Members See Also
---
Failures about DividedSurface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DividedSurfaceFailures
```

Visual Basic
---
```text
Public NotInheritable Class DividedSurfaceFailures
```

Visual C++
---
```text
public ref class DividedSurfaceFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DividedSurfaceFailures
# See Also
BuiltInFailures..::..DividedSurfaceFailures Members
Autodesk.Revit.DB Namespace